pipe/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:                                        |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          10;
        startFace       3790;
    }
    outlet
    {
        type            patch;
        nFaces          10;
        startFace       3800;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       3810;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          2000;
        startFace       4010;
    }
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          2000;
        startFace       6010;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       8010;
    }
)

// ************************************************************************* //
